DELETE FROM transactions;

INSERT INTO transactions (type_of_trans, sub_type_of_trans, category, descr_of_trans, amount, insert_date) VALUES
(2, 2, 'Τρόφιμα', 'Σούπερ Μάρκετ', 150.00, '2024-02-05'),
(2, 2, 'Τρόφιμα', 'Μαναβική', 45.00, '2024-02-15'),
(2, 2, 'Τρόφιμα', 'Κρεοπωλείο', 80.00, '2024-03-12'),
(2, 2, 'Τρόφιμα', 'Σούπερ Μάρκετ 2', 30.00, '2024-04-09'),
(2, 2, 'Λογαριασμοί', 'Ηλεκτρικό Ρεύμα', 90.00, '2024-01-22'),
(2, 2, 'Λογαριασμοί', 'Νερό', 25.00, '2024-02-11'),
(2, 2, 'Λογαριασμοί', 'Τηλέφωνο', 40.00, '2024-03-03'),
(2, 2, 'Λογαριασμοί', 'Ίντερνετ', 28.00, '2024-04-18'),
(1, 2, 'Έκτακτα Εισοδήματα', 'Πώληση Αυτοκινήτου', 3000.00, '2024-01-15'),
(1, 2, 'Έκτακτα Εισοδήματα', 'Καζίνο', 550.00, '2024-03-27'),
(1, 2, 'Έκτακτα Εισοδήματα', 'Αναδρομικά', 800.00, '2024-04-04'),
(1, 2, 'Έκτακτα Εισοδήματα', 'Υπερημερίες', 235.00, '2024-05-14'),
(2, 1, 'Αυτοκίνητο', 'Βενζίνη', 180.00, '2024-02-10'),
(2, 1, 'Διακοπές', 'Λονδίνο', 780.00, '2024-02-25'),
(2, 2, 'Αυτοκίνητο', 'Σέρβις', 1200.00, '2024-04-02'),
(1, 1, 'Μισθοδοσία', 'Βασικός Μισθός', 750.00, '2024-03-09'),
(2, 2, 'Ψυχαγωγία', 'Θερινό Σινεμά', 15.00, '2024-05-19'),
(2, 1, 'Δάνειο', 'Στεγαστικό', 450.00, '2024-04-22');





SELECT * FROM transactions;